{
  "format": "layers-model",
  "generatedBy": "mesonet-converter",
  "convertedBy": "manual-h5-to-tfjs",
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "model",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              256,
              256,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input_2"
          },
          "name": "input_2",
          "inbound_nodes": []
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_5",
            "trainable": true,
            "dtype": "float32",
            "filters": 8,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_5",
          "inbound_nodes": [
            [
              [
                "input_2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_5",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              3
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "name": "batch_normalization_5",
          "inbound_nodes": [
            [
              [
                "conv2d_5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_5",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "name": "max_pooling2d_5",
          "inbound_nodes": [
            [
              [
                "batch_normalization_5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_6",
            "trainable": true,
            "dtype": "float32",
            "filters": 8,
            "kernel_size": [
              5,
              5
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_6",
          "inbound_nodes": [
            [
              [
                "max_pooling2d_5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_6",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              3
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "name": "batch_normalization_6",
          "inbound_nodes": [
            [
              [
                "conv2d_6",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "name": "max_pooling2d_6",
          "inbound_nodes": [
            [
              [
                "batch_normalization_6",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_7",
            "trainable": true,
            "dtype": "float32",
            "filters": 16,
            "kernel_size": [
              5,
              5
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_7",
          "inbound_nodes": [
            [
              [
                "max_pooling2d_6",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_7",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              3
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "name": "batch_normalization_7",
          "inbound_nodes": [
            [
              [
                "conv2d_7",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "name": "max_pooling2d_7",
          "inbound_nodes": [
            [
              [
                "batch_normalization_7",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_8",
            "trainable": true,
            "dtype": "float32",
            "filters": 16,
            "kernel_size": [
              5,
              5
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_8",
          "inbound_nodes": [
            [
              [
                "max_pooling2d_7",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_8",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              3
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "name": "batch_normalization_8",
          "inbound_nodes": [
            [
              [
                "conv2d_8",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              4,
              4
            ],
            "padding": "same",
            "strides": [
              4,
              4
            ],
            "data_format": "channels_last"
          },
          "name": "max_pooling2d_8",
          "inbound_nodes": [
            [
              [
                "batch_normalization_8",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "name": "flatten_2",
          "inbound_nodes": [
            [
              [
                "max_pooling2d_8",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          },
          "name": "dropout_3",
          "inbound_nodes": [
            [
              [
                "flatten_2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "trainable": true,
            "dtype": "float32",
            "units": 16,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_3",
          "inbound_nodes": [
            [
              [
                "dropout_3",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "name": "leaky_re_lu_1",
            "trainable": true,
            "dtype": "float32",
            "negative_slope": 0.1
          },
          "name": "leaky_re_lu_1",
          "inbound_nodes": [
            [
              [
                "dense_3",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_4",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          },
          "name": "dropout_4",
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_4",
          "inbound_nodes": [
            [
              [
                "dropout_4",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "input_2",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "dense_4",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv2d_5/kernel:0",
          "shape": [
            3,
            3,
            3,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_5/bias:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/gamma:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/beta:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/moving_mean:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/moving_variance:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_6/kernel:0",
          "shape": [
            5,
            5,
            8,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_6/bias:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/gamma:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/beta:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/moving_mean:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/moving_variance:0",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_7/kernel:0",
          "shape": [
            5,
            5,
            8,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_7/bias:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/gamma:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/beta:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/moving_mean:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/moving_variance:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_8/kernel:0",
          "shape": [
            5,
            5,
            16,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_8/bias:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/gamma:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/beta:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/moving_mean:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/moving_variance:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel:0",
          "shape": [
            1024,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias:0",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/kernel:0",
          "shape": [
            16,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/bias:0",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}